__author__ = 'Ablezgov Andrew'

# Задача-3: По введенным пользователем координатам двух точек
# вывести уравнение прямой вида y=kx+b, проходящей через эти точки.

X1 = float(input('Введите координаты первой точки \nX: '))
Y1 = float(input('Y: '))

X2 = float(input('Введите координаты второй точки \nX: '))
Y2 = float(input('Y: '))

if (X1 - X2) == 0 or (Y1 - Y2) == 0:

    K = 0
    B = Y2
    print(f'\nУравнение прямой по указанным Вами точкам: y = {B}')

else:

    K = (Y1 - Y2) / (X1 - X2)
    B = Y2 - K * X2
    if B > 0:
        print(f'\nУравнение прямой по указанным Вами точкам: y = {K} * x + {B}')
    elif B == 0:
        print(f'\nУравнение прямой по указанным Вами точкам: y = {K} * x')
    else:
        print(f'\nУравнение прямой по указанным Вами точкам: y = {K} * x - {B}')

