__author__ = 'Ablezgov Andrew'

# Задача-8. Определить, является ли год, который ввел пользователем, високосным или невисокосным.

YEAR = int(input('Укажите год: '))

if YEAR % 4 != 0 or (YEAR % 100 == 0 and YEAR % 400 != 0):
    print(f'{YEAR} год не является високосным')
else:
    print(f'{YEAR} год является високосным')

