__author__ = 'Ablezgov Andrew'

# Задача-6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

LETTER_NUMBER = int(input('Введите номер интересующей Вас буквы:'))

print(f'Введенному Вами номеру соответствует буква:  {chr(LETTER_NUMBER + 96)}')

