__author__ = 'Ablezgov Andrew'

# Задача: В программе генерируется случайное целое число от 0 до 100. Пользователь должен его отгадать
# не более чем за 10 попыток. После каждой неудачной попытки должно сообщаться больше или меньше
# введенное пользователем число, чем то, что загадано. Если за 10 попыток число не отгадано,
# то вывести загаданное число.

from random import randint


def task6(number, n=10):

    answer = int(input('Введите число: '))

    if answer == number:
        return print('Поздравляю, Вы угадали число!')
    else:
        n -= 1
        if n == 0:
            return print(f'Игра окончена. К сожалению, Вы не отгадали. Правильный ответ был: {number}')
        else:
            if answer > number:
                print(f'Ответ неверный! Загаданное число меньше! У Вас осталось {n} попыток')
                task6(number, n)
            else:
                print(f'Ответ неверный! Загаданное число больше! У Вас осталось {n} попыток')
                task6(number, n)


print('Сыграем в игру угадайка. Компьютер загадал число от 0 до 100. Отгадайте его. Вам дано 10 попыток.')

RAND_NUMBER = randint(0, 100)
task6(RAND_NUMBER)

