__author__ = 'Ablezgov Andrew'

# Задача: Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
# Количество элементов (n) вводится с клавиатуры.

def task4(n, summ = 0, a = 1, b = -0.5):

    if n == 0:
        return print(f'Сумма заданного числа элементов ряда 1, -0.5, 0.25, -0.125 равна: {summ}')
    else:
        summ = summ + a
        a -= 0.75
        n -= 1

    if n == 0:
        return print(f'Сумма заданного числа элементов ряда 1, -0.5, 0.25, -0.125 равна: {summ}')
    else:
        summ = summ + b
        b -= 0.75
        n -= 1
        task4(n, summ, a, b)

n = int(input('Введите число элементов ряда: '))
task4(n)