__author__ = 'Ablezgov Andrew'

# Задача: Вывести на экран коды и символы таблицы ASCII, начиная с символа под номером 32 и
# заканчивая 127-м включительно. Вывод выполнить в табличной форме: по десять пар "код-символ" в каждой строке.

enter = 0

for i in range(32, 128):
    print(f'{"%4d" %i} - {chr(i)}', end=' ')
    enter += 1
    if enter % 10 == 0:
        print()
        enter = 0

print()

