__author__ = 'Ablezgov Andrew'

# Задача: Написать программу, которая будет складывать, вычитать, умножать или делить два числа.
# Числа и знак операции вводятся пользователем. После выполнения вычисления программа не должна
# завершаться, а должна запрашивать новые данные для вычислений. Завершение программы должно
# выполняться при вводе символа '0' в качестве знака операции. Если пользователь вводит
# неверный знак (не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и снова
# запрашивать знак операции. Также сообщать пользователю о невозможности деления на ноль,
# если он ввел 0 в качестве делителя.

def calculator():

    NUMB_ONE = int(input('Введите первое число: '))
    NUMB_TWO = int(input('Введите второе число: '))
    SIGN = input('Введите знак "+", "-", "*", "/" (для выхода из программы введите "0"):  ')
    if SIGN == '0':
        return
    elif SIGN == '+':
        print(f'Результат запрошенной операции: {NUMB_ONE + NUMB_TWO}')
        return calculator()
    elif SIGN == '-':
        print(f'Результат запрошенной операции: {NUMB_ONE - NUMB_TWO}')
        return calculator()
    elif SIGN == '*':
        print(f'Результат запрошенной операции: {NUMB_ONE * NUMB_TWO}')
        return calculator()
    elif SIGN == '/':
        if NUMB_TWO != 0:
            print(f'Результат запрошенной операции: {NUMB_ONE / NUMB_TWO}')
            return calculator()
        else:
            print('На ноль делить нельзя!')
            return
    else:
        print('Вы ввели неверный знак')
        return

calculator()