__author__ = 'Ablezgov Andrew'

# Задача: Во втором массиве сохранить индексы четных элементов первого массива.
# Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй массив надо заполнить
# значениями 1, 4, 5, 6 (или 0, 3, 4, 5 - если индексация начинается с нуля),
# т.к. именно в этих позициях первого массива стоят четные числа.

LIST = [8, 3, 15, 6, 4, 2]
LIST2 = []

for i, j in enumerate(LIST):
    if j % 2 == 0:
        LIST2.append(i)

print(f'Список индексов четных элементов первого массива: {LIST2}')